# Минимум из двух чисел
# Даны два целых числа. Выведите значение наименьшего из них.

a = int(input())
b = int(input())

if a < b:
    print(str(a))
else:
    print(str(b))