# Вычисления
# Дано натуральное число. Выведите его последнюю цифру.

num = int(input())

print(str(num % 10))