# Удаление символа
# Дана строка. Удалите из этой строки все символы @.

s = input()

sNew = s.replace('@', '')

print(sNew)