# Количество слов
# Дана строка, состоящая из слов, разделенных пробелами. 
# Определите, сколько в ней слов.

s = input()

w = s.count(' ') + 1

print(w)